In [13]:
import pandas as pd
import numpy  as np
ser1 = pd.Series(np.arange(4)*10)
ser1

0     0
1    10
2    20
3    30
dtype: int32

In [14]:
import pandas as pd
import numpy  as np
index=['a','b','c','d']
ser2 = pd.Series(np.arange(4)*10, index)
ser2

a     0
b    10
c    20
d    30
dtype: int32

In [17]:
ser2['b':'c'] # 숫자는 끝자리가 안 들어가는데, 문자열은 끝까지 들어감

b    10
c    20
dtype: int32

In [18]:
ser2['b':'d']

b    10
c    20
d    30
dtype: int32

In [21]:
ser2[1:3]

b    10
c    20
dtype: int32

In [23]:
ser2[1:4]

b    10
c    20
d    30
dtype: int32

In [31]:
data = np.arange(16).reshape((4,4))
index = ["Ohio", 'Colorado', 'Utah', "New York"]
columns = ['One', "Two", 'Three', "Four"]
df1 = pd.DataFrame(data, index, columns)
df1

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
df1.Four

Ohio         3
Colorado     7
Utah        11
New York    15
Name: Four, dtype: int32

In [35]:
df1[['Two', 'Four']] # 대괄호 두 개

          Two  Four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [37]:
df1[df1['Three']>5]

          One  Two  Three  Four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
#loc iloc 색인방법

In [39]:
df1.loc['Colorado', ['Two', 'Three']] # 이름으로 검색

Two      5
Three    6
Name: Colorado, dtype: int32

In [41]:
df1.iloc[2, [3,0,1]] # 정수색인

Four    11
One      8
Two      9
Name: Utah, dtype: int32

In [42]:
df1.iloc[[1,2], [1,2]]

          Two  Three
Colorado    5      6
Utah        9     10

In [44]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a','c','d','e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a','c','e','f','g'])

In [48]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64